[language]

Language name اسم اللغة

name=عربي

;---Amer Alhlhli --م/ عامر الحلحلي-----
[tips]


UACtips=هل تريد إضافة DockMod  إلى تجاوز UAC لن يطلب منك الموافقة على التحكم في حساب المستخدم في النافذة المنبثقة!
firsttip=لا يتقاضى هذا البرنامج أي رسوم ويحظر عليه بشكل صارم لأغراض تجارية. لن أكون مسؤولاً عن أي خسائر.
dwmerror=تم اكتشاف أن النظام لم يبدأ خدمة DWM ، ولا يمكن للبرنامج تشغيل بشكل طبيعي!
crashtip=لقد تعطل البرنامج ، وسيم إعادة تشغيله؟
;-------------------------------------

[iconame]

;اسم التسمية 

finder=الباحث
launchpad=منصة الإطلاق
cal=تقويم
trash=سلة المحذوفات

;آخر رمز في واجهة المجلد

explorer=مفتوح في Finder
return=العودة إلى السابق

;تنسيق اسم أيقونة وقت النظام

timeformat=yyyy/m/d/dddd
;تنسيق الوقت هو تنسيق وقت النظام 


remove=إزاله
addtopad=إضافة إلى منصة الإطلاق
iconisfull=أيقونة الصفحة الحالية ممتلئة

;------------------------------------------------- ----------

[systemicon]
;اسم أيقونة النظام
controlpanel=لوحة التحكم
taskbar=أيقونة الدرج
systemtime=وقت النظام
cortana=كورتانا
network= الشبكة
mydocument=ملفاتي
weather=الطقس
battery=البطارية

errortips=تمت إضافة هذا الرمز!


------------------------------------

[editicon]
;تحرير  أيقونة النافذة

addtips=يمكن سحب الملفات وإسقاطها هنا

reset=إعادة ضبط
ok=نعم
restore=استعاده
addname=تعديل اسم العرض
addicotips=انقر فوق الزر "..." في الزاوية اليمنى العليا لإضافة رمز
switch=تحويل
trashempty=سلة المحذوفات فارغة
trashfull=سلة المحذوفات ممتلئة
iconshell=استخدم قناع للايقونة
addline=الأمر Run
;منببطة تحدد عنوان نافذة الملف

selectfoldertitle=اختر مجلد
;مدينة البحث عن الطقس
searchcity=البحث عن اسم المدينة


;-------------------------------------

[editcal]

;تحرير نافذة التقويم

monthfont=خط الشهر:
dayfont=خط التاريخ:
monthpoint=موقع الشهر:
daypoint=موقع التاريخ:
monthposition=محاذاة الشهر:
dayposition=محاذاة التاريخ:
monthcolor=لون الشهر:
daycolor=لون التاريخ:
rotation=زاوية الدوران:
default=استخدم التكوين الافتراضي

ok=نعم
test=اختبار

left=يسار
right=يمين
center=وسط

; حدد عنوان نافذة الصورة المنبثقة

selectcalicon=اختر صورة للتقويم

;-------------------------------------

[editicontips]
;تظهر رسالة خطأ على واجهة أيقونة التحرير

iconduplicate=تمت إضافة هذا البرنامج إلى رصيف البرامج!

systemduplicate=تمت إضافة هذا الرمز!

titleerror=لا يمكن أن يكون اسم عرض البرنامج فارغًا!
filepatherror=لا يمكن أن يكون مسار البرنامج والرمز فارغًا!

padtitleerror1=تم تكرار اسم الملف ، يرجى إعادة الدخول!
padtitleerror2=فشل تعديل الملف ، يرجى عدم وضع البرنامج على محرك الأقراص!

formaterror=تنسيق غير مدعوم ، يرجى وضع PNG ، ICO ، EXE ، LNK Format!

;------------------------------------------------- -----------------------
;نافذة التفضيلات
[settingUI]

settitle=تفضيلات MyDockFinder

Global Settings=الاعدادات العامة

openMyDock=افتح MyDock
openMyFinder=افتح myfinder
MyDockerror=الرجاء فتح mydock
MyFindererror=الرجاء فتح myfinder

DPIscale=مقياس عرض الواجهة العالمية
Accentcolor=لون تأكيد الواجهة العالمية
darkmodeall=وضع لون الواجهة العالمية

darkmode_light=فاتح
darkmode_dark=غامق
darkmode_auto=آلي
darkmode_system=نظام

aero=قم بتشغيل تأثير الضبابية العالمية
systemdarkmode=يتبع لون النظام myDockFinder
autoupdate=تحقق تلقائيا من تحديثات البرنامج
systemstart=بدء تشغيل البرنامج مع تشغيل الويندوز
autohidetaskbar=إخفاء شريط المهام تلقائيًا عند بدء التشغيل

hidetaskbar_dock=يخفي الشاشة حيث شريط المهام
hidetaskbar_all=إخفاء جميع أدوات مهام الشاشة

DirectDXFPS=حدد معدل تحديث عرض DirectDX
languagechoice=اختر لغة عرض البرنامج
allfont=اختر برنامج البرنامج
defaultfont=الخط الافتراضي

general=عام
advanced=متقدم
preview=معاينة النافذة
minimizewindowsettings=تصغير النافذة

timeset=الوقت
audioset=الصوت
displayset=العرض
mediaset=الوسائط
batteryset=البطارية
netset=الشبكة
monitorset=الشاشة

about=حول

icosize=أيقونة الحجم الافتراضي
icomaxsize=الحجم الأقصى للرمز

icospace=المسافة بين الرموز
edgeposition=مسافة رصيف البرامج من حافة الشاشة


displaymode=حدد وضع Dock Display Hidden Mode
displaynormal=وضع العرض الافتراضي
displaybottom=وضع تراكب العرض
displayauto=وضع إخفاء تلقائي
displaysmart=وضع الاختباء الذكي
displayhotkey=وضع عرض مفتاح Hotkey
displayalways=إظهار الوضع دائمًا
displayhide= إخفاء الوضع دائما

Show activation bar=أظهر شريط التنشيط بعد إخفاء رصيف البرامج

positiononscreen=موقع شاشة رصيف البرامج
screenleft=يسار
screenbottom=أسفل
screenright=يمين
screentop=أعلى
multiscreen=حدد الشاشة لعرض رصيف البرامج
multiscreenpad=حدد الشاشة لعرض منصة الإطلاق
padscreenname=اتبع رصيف البرامج
lockicon=قفل أيقونة السحب
showicontag=إظهار النص جوار الأيقونة
windowsborder=قم بتشغيل حدود النافذة لمنع حجب النوافذ
jumpanimation=انقر على الرمز لعرض حركة الوثب قبل فتح البرامج
folderDoubleclickOpen=انقر نقرًا مزدوجًا فوق أيقونة المجلد لفتحها
gpurendicon=استخدم تكوين GPU لتقديم أيقونات رصيف البرامج
iconmask=أضف تأثير القناع لجميع الرموز
show indicators=إظهار مؤشرات التطبيقات المفتوحة
Runapp separator=إظهار حد لبرامج التشغيل الجديدة
newapp=إظهار أيقونة برامج التشغيل الجديدة
blacklist=إدارة قائمة الحظر
noblacklist=لا يوجد حظر
hotcornerleft=الإجراء عند التمرير في الزاوية اليسرى السفلى من الشاشة
hotcornerright=الإجراء عند التمرير في الزاوية اليمنى السفلى من الشاشة
hotkeypad=عرض Launchpad Hotkey
hotkeyDock=عرض Dock Hotkey

dockicobackup=ملف أيقونة رصيف النسخ الاحتياطي
backuplist=إدارة ملفات النسخ الاحتياطي
Addbackupdockico=إضافة أيقونة النسخ الاحتياطي
locationbackup=افتح مجلد النسخ الاحتياطي

minimize=قم بتصغير النوافذ المفتوحة إلى رصيف البرامج
animationoff= تقليل الرسوم المتحركة عند إغلاق النافذة
Slow animation=اضغط مع الاستمرار على مفتاح Shift لإبطاء الرسوم المتحركة
useMipMap=إنشاء نسيج MipMap
GDIscreenshot=تصغير لقطات الشاشة باستخدام GDI
screencapturetype=أنواع لقطات الشاشة
minimizeeffect=تصغير النافذة باستخدام المؤثرات الخاصة

genie=كما هو
scale=تكبير
scaleDX=مقياس DX
suck=استيعاب

Minimize to icon=تصغير النوافذ في أيقونة التطبيق
DirectX=حدد إصدار DirectX
SamplerState= طريقة تصغير ترشيح الخامات (يوصى باستخدام LINEAR مع DX11 وما فوق)
Minimizeblacklist=إلغاء تصغير التأثيرات المتحركة
Editwindowlist=تحرير قائمة البرامج


previewon=تمكين معاينة النافذة
previewsize=حجم معاينة النافذة
previewdelay=مدة تأخير معاينة العرض 

previewcontrol=إظهار عناصر المعاينة الأخرى
previewappname=اسم التطبيق
previewbutton=أزرار التحكم في النافذة
aeropeek=إظهار معاينة النافذة الكاملة عند تمرير الماوس


logotype=حدد نمط الزر على اليسار
diylogo=حدد ملف
shutdownmsgbox=سوف يؤكد بوب لإعادة تشغيل إيقاف النظام
finderdark=اختر وضع لون الباحث

finderdark_auto=الخلفية
finderdark_set=الضبط 

finderdisplaymode=حدد الوضع المخفي للمكتشف
finderautochangecolor=تكبير النافذة لاستخدام الوضع المجسم

showaudio=إظهار أيقونة الصوت في الباحث
showbattery=إظهار أيقونة البطارية في الباحث
showwifi=عرض أيقونة WiFi في الباحث
showbluetooth=عرض أيقونة البلوتوث في الباحث
showdisplay=عرض أيقونة الشاشة في الباحث
showcpu=وحدة المعالجة المركزية
showtemp=درجة الحرارة الأساسية
showmen=الرام
showdisk=القرص
shownet=الشبكة

formatdate=اختر تنسيق عرض التاريخ
formattime=اختر تنسيق عرض الوقت

showbatteryvalue=إظهار النسبة المئوية للبطارية
audiotip=تشغيل الصوت تغيير الصوت
mediatype=حدد نمط الصوت وسطوع الشاشة

media_system=نظام
media_mac=ماك
media_ios=ايفون

hotkeyvolup=مفتاح اختصار  لرفع الصوت
hotkeyvoldown=مفتاح اختصار لخفض الصوت
hotkeyvolmute=مفتاح اختصار لكتم الصوت


hotkeybriup=مفتاح اختصار لرفع السطوع 
hotkeybridown=مغتاح اختصار لخفض السطوع

theme=سمة

wallpaper=الخلفيات

selectwallpaper=حدد موضوع الخلفية
wallpapernone=لا شيء
loadwallpaper=تحميل خلفية الموضوع
wallpaperdownload=تنزيل موضوعات الخلفية من النت
wallpaperOK=تأكيد

contribute=دعم التبرعات
netdisk=زيارة الموقع
updatelog=تحديث سجل
update=تحقق من وجود تحديثات
restartdock=برنامج إعادة التشغيل
uninstall=برنامج إلغاء التثبيت

ok=موافق
cancel=إلغاء الأمر

------------------------------------------------------------
[hotcorners]
nothing=لا شئ
allwindows=عرض جميع النوافذ
launchpad=عرض منصة البرامج
displaytosleep=قم بإيقاف تشغيل الشاشة
startmenu=عرض قائمة ابدأ
showdesktop=أظهر سطح المكتب
actioncenter=مركز تشغيل Windows
screensaver=شاشة التوقف

[settingtips]

;تنبثق رسالة خطأ على واجهة الإعداد
gpurendtip=قد يتسبب تمكين هذا الخيار في تعطل الكمبيوتر. من فضلك لا تخرج من رصيف البرامج. تم تمكين هذا لبدء التشغيل مؤقتًا. سيؤدي الخروج من رصيف البرامج إلى حفظ هذا التكوين. إذا تعطل الكمبيوتر بعد فترة من الزمن ، فسوف يقوم بدء التشغيل التالي تلقائيًا بإلغاء عرض GPU Composite.
edgetip=لا يمكن تعديل حدود نافذة الحد المفتوح!
autohideerror=لا يمكن تمكين هذه الوظيفة عند فتح حدود النافذة!
neterror=خطأ في الشبكة ، يرجى التحقق من الاتصال.
autohide=لا يمكن الإخفاء التلقائي لن يتم تمكين هذه الوظيفة!
updateerror1=خطأ في الشبكة ، يرجى المحاولة مرة أخرى!
updateerror2=فشل التحديث عبر الإنترنت. هل تريد فتح صفحة التنزيل؟
updateerror3=العديد من المحاولات الفاشلة للتحديث ، يرجى تنزيل حزمة التحديث من موقع البرنامج!

updatetip1=هل هناك إصدار جديد تم تحديثه؟
updatetip2=هل تريد تحديث الملف فور التنزيل؟

noupdate=هذا هو أحدث إصدار ، لا حاجة للتحديث!
uninstalltip=هل تريد إزالة هذا البرنامج من النظام؟
restarttip=افتح بعد إعادة تشغيل البرنامج!
fontrestart=بعض الواجهات تحتاج إلى إعادة تشغيل البرنامج لمشاهدة التغييرات!

languagetips=بعض الواجهات تحتاج إلى إعادة تشغيل البرنامج لمشاهدة التغييرات!


uninstallcomplete=بعد اكتمال إلغاء التثبيت ، يرجى حذف أي ملفات متبقية يدويًا.

DPIerrortip=عامل التكبير الحالي أكبر من واجهة تكبير النظام. الشاشة كبيرة جدا!

restartruntip=هل تريد إعادة تشغيل البرنامج؟

backupfolderror=فشل في إنشاء مجلد النسخ الاحتياطي ، يرجى التحقق من أذونات الدليل!

backuptips=هل تريد استعادة ملف النسخ الاحتياطي هذا؟


;------------------------------------------------- -----------------

[menu]
;القائمة اليمنى


newfinderwindow=نافذة مكتشف جديدة
gotofolder=اذهب إلى المجلد ...
connecttoserver=سطح المكتب البعيد
showlaunchpad=عرض رصيف البرامج


addnormalicon=أضف رمز عادي
addsystemicon=إضافة أيقونة النظام
showtaskbar=عرض شريط المهام
hidetaskbar=إخفاء شريط المهام
preference=التفضيلات
enddock=إنهاء البرنامج

editicon=اضبط هذا الرمز
removefromdock=إزالة من رصيف البرامج
keepindock=الحفاظ على رصيف البرامج
locationfile=افتح موقع الملف
runagain=قم بتشغيل هذا البرنامج مرة أخرى
nevershowthis=لا تظهر هذا البرنامج مرة أخرى
adminmode=تشغيل وضع المسؤول
open=افتح
quit=خروج

emptytrash=افرغ سلة المحذوفات
sortorder=ترتيب حسب
Byname=الاسم
Bysize=الحجم
Byextension=الامتداد
Bydate/time=وقت التعديل
Createtime=وقت الانشاء
Groupdirectories=المجلدات أولاً
reverseorder=عكس الفرز
closewindow=أغلق هذه النافذة
Display=محتوى العرض هو
Folder=مجلد
Stack=حزمة
Locatefolder=افتح المجلد مباشرة
FolderEffect=تأثير العرض
Grid=الشبكة
Fan=المروحة
add delimiter=إضافة فاصل
del delimiter=إزالة الفاصل

showmodeapps=اضبط العرض المستقل ووضع الإخفاء
showmodedesktop=اضبط عرض سطح المكتب وإخفاءه
NominiEffect=لا تظهر نافذة تصغير التأثيرات المتحركة
showmodenormal=اتبع الإعدادات
msgtips=قم بإعداد تذكير بالرسالة
incognito=نافذة جديدة لوضع التصفح المتخفي

systemmenu=قائمة النظام

timeskin=حدد وجه الساعة
timedefault=افتراضي
timeMickey=رسوم 
----------------------------------------------

[launchpad]

addicon=إضافة أيقونة
deleteicon=حذف هذا الرمز
search=بحث
ok=موافق
addtips=يرجى سحب ملفات exe و lnk هنا
----------------------------------------------

[promptwindow]

;يمكن أن تطالب سلة المحذوفات الفارغة والمطالبات الأخرى

ok=نعم
cancel=إلفاء
trashok=افرغ سلة المحذوفات
trashtitle=هل أنت متأكد من أنك تريد تفريغ العناصر الموجودة في سلة المحذوفات؟
batterytip=يرجى توصيل الشاحن إذا كانت البطارية منخفضة!
apperror=البرنامج تالف ، يرجى التنزيل مرة أخرى!
eject=تمت الإزالة بأمان

-----------------------------------------------
;وصف تنسيق الوقت
;يوم DDD من الأسبوع DDDD يوم الأسبوع M MONTR
;أحرف مزدوجة مع رقمين على سبيل المثال HH: MM: SS 09:06:05
;يمكن تخصيص جميع التنسيقات التالية وتعديلها ، ويمكن إضافة الرقم الموجود على اليسار دون حد= ترك فارغة للإشارة إلى عدم عرض التاريخ
;بعد حفظ التعديل ، سيتم سريان ساري المفعول على الفور ، ثم قم بتعيينه مباشرةً وانقر فوق قائمة تنسيق الوقت لعرض التأثير
[formatdate]
1=
2=ddd
3=MMMd
4=MMMd ddd
5=ddd MMMd

[formattime]
1=H:mm
2=tt h:mm
3=H:mm:ss
4=tt h:mm:ss

[calicon]

;نص رمز التقويم

m1=يناير
m2=فبراير
m3=مارس
m4=أبريل
m5=مايو
m6=يونيو
m7=يوليو
m8=أغسطس
m9=سبتمبر
m10=أكتوبر
m11=نوفمبر
m12=ديسمبر


[findermenu]
bluetooth=بلوتوث
Bluetooth settings=إعدادات البلوتوث ...
device=الجهاز
Preferred network=الشبكة المفضلة
other networks=شبكات أخرى
network settings =اعدادات الشبكة...
Audio=الصوت
output=المخرجات |
audio settings=إعدادات الصوت...
battery settings=إعدادات البطارية ...
BatteryEstimatedTime=متبقي
batterytime_hour=ساعات
batterytime_min=دقائق
Edit title=تحرير العنوان
Window border=حدود النافذة
end finder= إنهاء البرنامج  ...
About This PC=حول هذا الكمبيوتر
System settings=اعدادات النظام...
app Store=متجر التطبيقات...
Task manager=مدير المهام
Sleep=سكون
Dormant= إسبات 
Shutdown=إيقاف التشغيل 
Reboot=اعادة التشغيل...
Lock screen=اقفل الشاشة
Logout=تسجيل الخروج...

symbol=إظهار المشاعر والرموز
Screen Keyboard=عرض لوحة المفاتيح على الشاشة
keyboardname=إظهار اسم لوحة المفاتيح
Keyboard settings=إعدادات لوحة المفاتيح ...
display=عرض
systemdark=الوضع المظلم
bluelight=ضوء أزرق
displayset=اعدادات العرض...
hotspot= بث نقطة وصول
airplane=وضع الطيران
deviceon=على
deviceoff=إغلاق
eject=إزالة بأمان

[findertips]
Mute=صامت
battery=البطارية
AcOnLine=على الشاحن
Charging=جاري الشحن
notCharging=لا يتم الشحن
Usebattery=على البطارية
Full battery=البطارية ممتلئة
brightness=السطوع
show trayico=عرض على شريط المهام

[findertitle]
file=ملف
Edit=تحرير
Show=عرض
Go to=اذهب إلى
windows=النوافذ
Help=مساعدة

[shutdown]
shutdown=هل تريد إغلاق هذا الكمبيوتر؟
Reboot=هل تريد إعادة تشغيل الكمبيوتر؟
Logout=هل ترغب بالخروج؟
Dormant=هل تريد إسبات هذا الكمبيوتر؟
sleep=هل تريد سكون هذا الكمبيوتر؟
ok=موافق
cancel=إلغاء الأمر
[wifi]
password=كلمة المرور:
showpassword=عرض كلمة المرور
join=انضمام
cancel=إلغاء الأمر


[weather]
00 = مشمس
01 = غائم
02 = يوم غائم
03 = أمطار
04 = أمطار رعدية
05 = عواصف رعدية مصحوبة ببرد
06 = الصقيع
07 = أمطار خفيفة
08 = أمطار معتدلة
09 = أمطار غزيرة
10 = عاصفة ممطرة
11 = أمطار غزيرة
12 = أمطار غزيرة
13 = زخات ثلج
14 = ثلوج خفيفة
15 = ثلوج
16 = ثلوج كثيفة
17 = عاصفة ثلجية
18 = ضباب
19 = أمطار متجمدة
20 = عاصفة رملية
21 = أمطار خفيفة إلى معتدلة
22 = أمطار معتدلة إلى غزيرة
23 = أمطار غزيرة
24 = أمطار غزيرة إلى أمطار غزيرة
25 = أمطار غزيرة إلى أمطار غزيرة
26 = ثلج صغير إلى متوسط
27 = متوسط ​​إلى ثلوج كثيفة
28 = عاصفة ثلجية كبيرة
29 = الغبار العائم
30 = رمل
31 = عاصفة رملية قوية
32 = ضباب كثيف
33 = ثلج
49 = ضباب قوي
53 = ضباب
54 = ضباب معتدل
55 = ضباب كثيف
56 = ضباب شديد
57 = ضباب كثيف
58 = ضباب قوي
301 = مطر
302 = ثلج